app/controllers/appointments_controller.rb

  def index
    if current_user.user_type == "patient"
    @appointments = Appointment.where(:patient_id => @patient).order(:appointmentdate, :appointmenttime)
    else
    @appointments = Appointment.where(:doctor_id => @doctor).order(:appointmentdate, :appointmenttime)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ? ORDER BY "appointments"."appointmentdate" ASC, "appointments"."appointmenttime" ASC  [["patient_id", 3]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" IS NULL ORDER BY "appointments"."appointmentdate" ASC, "appointments"."appointmenttime" ASC

  def create

    @appointment = @patient.appointments.new(appointment_params)

    if @appointment.save
       #flash[:success] = "You have updated #{@appointment.appointmentdate.year} #{@appointment.appointmentdate.month} #{@appointment.appointmentdate.day}."
       @schedule = Schedule.create(:title => 'Booked' , :start => DateTime.new(@appointment.appointmentdate.year,@appointment.appointmentdate.month, @appointment.appointmentdate.day, @appointment.appointmenttime.hour,@appointment.appointmenttime.min,@appointment.appointmenttime.sec) , :end => DateTime.new(@appointment.appointmentdate.year,@appointment.appointmentdate.month, @appointment.appointmentdate.day, @appointment.appointmenttime.hour +  1,@appointment.appointmenttime.min,@appointment.appointmenttime.sec), :doctor_id => @appointment.doctor_id)
---
INSERT INTO "appointments" ("appointmentdate", "patient_id", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["appointmentdate", "2019-06-28"], ["patient_id", 3], ["doctor_id", 1], ["created_at", "2019-06-15 22:36:00.267085"], ["updated_at", "2019-06-15 22:36:00.267085"]]
INSERT INTO "schedules" ("title", "start", "end", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Booked"], ["start", "2019-06-28 15:00:00"], ["end", "2019-06-28 16:00:00"], ["doctor_id", 1], ["created_at", "2019-06-17 10:34:25.025058"], ["updated_at", "2019-06-17 10:34:25.025058"]]
SELECT "doctors".* FROM "doctors" ORDER BY last_name

    def set_doctors
      if current_user.user_type == "patient"
      @doctors =  Doctor.all.order("last_name")
---
SELECT  "doctors".* FROM "doctors" ORDER BY last_name LIMIT ?  [["LIMIT", 11]]

    def set_patient
      if current_user.user_type == "patient"
      @patient = @current_patient
      else
      @patients =  Patient.all.order("last_name")
---
SELECT "patients".* FROM "patients" ORDER BY last_name