app/controllers/doctors_controller.rb

  def show
    @doctor  = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    user_params = {
    email: doctor_params["email"],
    password: doctor_params["password"],
    user_type: "doctor"
  }

   user = User.new(user_params)
   user.save!
   new_params = doctor_params
   new_params["user_id"] = user.id
   @doctor = Doctor.new(new_params)    # Not the final implementation!
   if @doctor.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?)
INSERT INTO "doctors" ("first_name", "middle_name", "last_name", "image_url", "speciality", "bio", "address", "email", "phone_no", "gp_number", "created_at", "updated_at", "hourlycharge", "user_id", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "email" = ?, "phone_no" = ?, "gp_number" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["email", "john.bennett@innomed.ie"], ["phone_no", "01 4555636"], ["gp_number", "D33 M5567"], ["updated_at", "2019-06-05 14:18:19.020920"], ["id", 1]]