app/controllers/notes_controller.rb

    def set_patient
      @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]