app/controllers/patients_controller.rb

  def create
   # @patient = Patient.new(patient_params)

    #respond_to do |format|
    #if @patient.save
     #   format.html { redirect_to @patient, notice: 'Patient was successfully created.' }
      # format.json { render :show, status: :created, location: @patient }
    #else
     #  format.html { render :new }
      #format.json { render json: @patient.errors, status: :unprocessable_entity }
    #end
  #end

  user_params = {
    email: patient_params["email"],
    password: patient_params["password"],
    user_type: "patient"
  }

   user = User.new(user_params)
   user.save!
   new_params = patient_params
   new_params["user_id"] = user.id
   @patient = Patient.new(new_params)    # Not the final implementation!
   if @patient.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?)
INSERT INTO "patients" ("first_name", "last_name", "phoneNo", "email", "gender", "address", "insurance", "created_at", "updated_at", "password_digest", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)