app/controllers/prescriptions_controller.rb

SELECT "prescriptions".* FROM "prescriptions"
---
  def index
    @prescriptions = Prescription.all