app/controllers/remoteconsultations_controller.rb

	def create
		@remoteconsultation = Remoteconsultation.new(remoteconsultation_params)

		if @remoteconsultation.save
---
INSERT INTO "remoteconsultations" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new"], ["content", "Post"], ["created_at", "2019-06-23 17:26:08.766823"], ["updated_at", "2019-06-23 17:26:08.766823"]]

    def show
        @remoteconsultation = Remoteconsultation.find(params[:id])
---
SELECT  "remoteconsultations".* FROM "remoteconsultations" WHERE "remoteconsultations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]