app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."doctor_id" = ?  [["doctor_id", 1]]
---
  def index
    #@schedules = Schedule.all
     if !params[:doctor_id].blank?

    @schedules = @doctor.schedules
     else
     @schedules = Schedule.all

INSERT INTO "schedules" ("title", "start", "end", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["start", "2019-06-15 11:59:00"], ["end", "2019-06-15 11:59:00"], ["doctor_id", 3], ["created_at", "2019-06-15 11:59:58.568763"], ["updated_at", "2019-06-15 11:59:58.568763"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
  def destroy
    @schedule.destroy

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_doctor
      if !params[:doctor_id].blank?
      @doctor = Doctor.find(params[:doctor_id])