app/controllers/sessions_controller.rb

  def create
      user = User.find_by(email: params[:session][:email].downcase)
      patient = Patient.find_by(email: params[:session][:email].downcase)
      doctor = Doctor.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "stevewilliams@innomed.com"], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT ?  [["email", "mr@gmail.com"], ["LIMIT", 1]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."email" = ? LIMIT ?  [["email", "stevewilliams@innomed.com"], ["LIMIT", 1]]