app/views/appointments/new.html.erb

SELECT "doctors".* FROM "doctors" ORDER BY last_name
---
  <%= f.label :Doctor %>
  <%= f.select:doctor_id, @doctors.collect { |d| [d.full_name, d.id]}, {:prompt => "--Select Doctor--"},{:onchange=>"setDoctor(this.value);"} %>